Applying **Development**:

```diff
random_id.this: Refreshing state... [id=XQ]
module.complete.random_id.this: Refreshing state... [id=3Q]
data.http.my_public_ip: Reading...
module.complete.data.http.my_public_ip: Reading...
module.complete.data.archive_file.lambda_zip: Reading...
module.key-pair.tls_private_key.this[0]: Refreshing state... [id=d61857760060ac9a400b6151dc82097725229b4f]
module.complete.data.archive_file.lambda_zip: Read complete after 0s [id=7517866eb05f876f45c1f92f4725f6c55a51fdd7]
module.complete.data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
module.key-pair.aws_key_pair.this[0]: Refreshing state... [id=sophos-example-complete5d]
module.complete.aws_iam_role.lambda_execution_role: Refreshing state... [id=LambdaExecutionRole-SOPHOS_CNF-dd]
data.aws_region.current: Reading...
data.aws_availability_zones.available: Reading...
module.complete.data.aws_iam_policy_document.trust_relationship: Reading...
module.complete.data.aws_caller_identity.current: Reading...
module.complete.aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-dd-Bve1ON]
module.complete.data.aws_ami_ids.sfos: Reading...
data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-dd-Bve1ON]
module.complete.aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-dd-PgxsaE]
module.complete.data.aws_availability_zones.available: Reading...
module.complete.data.aws_region.current: Reading...
module.complete.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-dd-PgxsaE|006D5291-3AD8-456C-9951-52B7B7EB832D]
module.complete.data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
module.complete.aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-dd-Bve1ON|7E554A89-E20C-47A9-B624-87A3C0A4C679]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Read complete after 0s [id=4277679882]
data.aws_availability_zone.available["us-west-1b"]: Reading...
data.aws_availability_zone.available["us-west-1c"]: Reading...
module.complete.data.template_file.user_data: Reading...
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-dd-Bve1ON|268F8A20-6E87-4D89-A93F-97F82D9C1CAD]
module.complete.data.template_file.user_data: Read complete after 0s [id=9fe490c278459d75ba83b9dec40a4054c5715f17b1557d6610649eb2cb028223]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Reading...
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Read complete after 0s [id=482096056]
data.aws_availability_zone.available["us-west-1b"]: Read complete after 0s [id=us-west-1b]
data.aws_availability_zone.available["us-west-1c"]: Read complete after 0s [id=us-west-1c]
module.complete.data.aws_ami_ids.sfos: Read complete after 0s [id=1726762986]
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 0s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 0s [id=ami-07186848dc5aa7580]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 0s [id=ami-04b0be28f678af9ee]
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 0s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 0s [id=ami-065fabeba927f04d3]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 0s [id=ami-091558582143f9648]
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 0s [id=ami-0fb2a8cf2684fdb0c]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 0s [id=ami-026c32ba32c93b8c4]
module.complete.aws_vpc.this[0]: Refreshing state... [id=vpc-0e5b28f9e0f726640]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 0s [id=ami-03cbb6f8e3173ca7a]
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Read complete after 0s [id=ami-0434af33056d1e189]
module.complete.aws_iam_role.this: Refreshing state... [id=ec2-iam-role-SOPHOS_CNF-dd-447552758530]
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Read complete after 0s [id=ami-0028214389e81fc39]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 0s [id=ami-059bf44c0f5e904d9]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 0s [id=ami-0eafce265f8e28d06]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 0s [id=ami-0442ca42ae7162b75]
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 0s [id=ami-030bf19f87a227c8a]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 0s [id=ami-0b68236d144f48351]
module.complete.aws_security_group.public[0]: Refreshing state... [id=sg-09776ffa66e6303de]
module.complete.aws_route_table.public[0]: Refreshing state... [id=rtb-009a36b1352658cb9]
module.complete.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a166b60b9cd9164d]
module.complete.aws_security_group.lan[0]: Refreshing state... [id=sg-019f5d3d55cdde897]
module.complete.aws_subnet.private[0]: Refreshing state... [id=subnet-0b01cfcf7afaf8a99]
module.complete.aws_security_group.trusted[0]: Refreshing state... [id=sg-0633e24f1bc6e9a2c]
module.complete.aws_route_table.private[0]: Refreshing state... [id=rtb-00062e80ee9bb3d1d]
module.complete.aws_subnet.public[0]: Refreshing state... [id=subnet-026e8cb0facbdd665]
module.complete.aws_route.public: Refreshing state... [id=r-rtb-009a36b1352658cb91080289494]
module.complete.aws_route_table_association.public: Refreshing state... [id=rtbassoc-0889ff52fe30155f2]
module.complete.aws_network_interface.public: Refreshing state... [id=eni-0596b98a898164aab]
module.complete.aws_network_interface.private: Refreshing state... [id=eni-0a83dab759fd9c357]
module.complete.aws_route_table_association.private: Refreshing state... [id=rtbassoc-003add6eca66b1df6]
module.complete.aws_route.private: Refreshing state... [id=r-rtb-00062e80ee9bb3d1d1080289494]
module.complete.aws_eip.this[0]: Refreshing state... [id=eipalloc-0bc31b5c2c259ad15]
module.complete.aws_iam_instance_profile.this: Refreshing state... [id=ec2-instance-profile-SOPHOS_CNF-dd]
module.complete.aws_launch_template.this: Refreshing state... [id=lt-081750a482a63ae63]
module.complete.aws_instance.this: Refreshing state... [id=i-008e12b711ced33f1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place

Terraform will perform the following actions:

  # module.complete.aws_eip.this[0] will be updated in-place
  ~ resource "aws_eip" "this" {
        id                        = "eipalloc-0bc31b5c2c259ad15"
      ~ tags                      = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.complete.aws_iam_instance_profile.this will be updated in-place
  ~ resource "aws_iam_instance_profile" "this" {
        id          = "ec2-instance-profile-SOPHOS_CNF-dd"
        name        = "ec2-instance-profile-SOPHOS_CNF-dd"
      ~ tags        = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all    = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "ec2-iam-role-SOPHOS_CNF-dd-447552758530"
        name                  = "ec2-iam-role-SOPHOS_CNF-dd-447552758530"
      ~ tags                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all              = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.complete.aws_instance.this will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-008e12b711ced33f1"
      ~ source_dest_check                    = false -> true
      ~ tags                                 = {
-           "Name"          = "sophos-xg-terraform"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                             = {
-           "Name"          = "sophos-xg-terraform"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ user_data                            = "1be61f38db292e6272a4d799c8c11bb176a88242" -> "39d80ed4a21b453fab5490ac2889f1ca89927ee3"
        # (28 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # module.complete.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-0a166b60b9cd9164d"
      ~ tags     = {
-           "Name"          = "igw-SOPHOS_CNF-dd-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all = {
-           "Name"          = "igw-SOPHOS_CNF-dd-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.complete.aws_lambda_function.this will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       filename                       = "../../initial_config.zip"
+       function_name                  = "XG-Initial-Config-SOPHOS_CNF-dd"
+       handler                        = "config.main"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = "arn:aws:iam::447552758530:role/LambdaExecutionRole-SOPHOS_CNF-dd"
+       runtime                        = "python3.7"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = (known after apply)
+       timeout                        = 3
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "CONSOLE_SECRET_NAME" = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-dd-PgxsaE"
+               "IP"                  = "10.0.1.209"
+               "PASSWORD"            = "admin"
+               "REGION_NAME"         = "us-west-1"
+               "USERNAME"            = "admin"
            }
        }

+       ephemeral_storage {
+           size = (known after apply)
        }

+       tracing_config {
+           mode = (known after apply)
        }

+       vpc_config {
+           security_group_ids = [
+               "sg-019f5d3d55cdde897",
            ]
+           subnet_ids         = [
+               "subnet-0b01cfcf7afaf8a99",
            ]
+           vpc_id             = (known after apply)
        }
    }

  # module.complete.aws_launch_template.this will be updated in-place
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-081750a482a63ae63"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "launch-template-SOPHOS_CNF-dd-447552758530"
      ~ tags                    = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.complete.aws_network_interface.private will be updated in-place
  ~ resource "aws_network_interface" "private" {
        id                        = "eni-0a83dab759fd9c357"
      ~ tags                      = {
-           "Name"          = "private-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "private-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_network_interface.public will be updated in-place
  ~ resource "aws_network_interface" "public" {
        id                        = "eni-0596b98a898164aab"
      ~ tags                      = {
-           "Name"          = "public-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "public-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-00062e80ee9bb3d1d"
      ~ tags             = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-dd-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-dd-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-009a36b1352658cb9"
      ~ tags             = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-dd-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-dd-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.lan[0] will be updated in-place
  ~ resource "aws_security_group" "lan" {
        id                     = "sg-019f5d3d55cdde897"
        name                   = "Private Subnet"
      ~ tags                   = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.public[0] will be updated in-place
  ~ resource "aws_security_group" "public" {
        id                     = "sg-09776ffa66e6303de"
        name                   = "Public"
      ~ tags                   = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-0633e24f1bc6e9a2c"
      ~ ingress                = [
-           {
-               cidr_blocks      = [
-                   "47.184.79.94/32",
-                   "13.65.56.73/32",
                ]
-               description      = "Allow all from trusted IP"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
+           {
+               cidr_blocks      = [
+                   "47.184.79.94/32",
+                   "20.245.126.21/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
      ~ tags                   = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.complete.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-026e8cb0facbdd665"
      ~ tags                                           = {
-           "Name"          = "public-SOPHOS_CNF-dd-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                                       = {
-           "Name"          = "public-SOPHOS_CNF-dd-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.complete.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-0e5b28f9e0f726640"
      ~ tags                             = {
-           "Name"          = "SOPHOS_CNF-dd-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                         = {
-           "Name"          = "SOPHOS_CNF-dd-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

Plan: 1 to add, 15 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

```
module.complete.data.archive_file.lambda_zip: Reading...
module.complete.data.http.my_public_ip: Reading...
data.http.my_public_ip: Reading...
module.complete.data.archive_file.lambda_zip: Read complete after 0s [id=7517866eb05f876f45c1f92f4725f6c55a51fdd7]
random_id.this: Refreshing state... [id=XQ]
module.key-pair.tls_private_key.this[0]: Refreshing state... [id=d61857760060ac9a400b6151dc82097725229b4f]
module.complete.random_id.this: Refreshing state... [id=3Q]
module.complete.data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
module.key-pair.aws_key_pair.this[0]: Refreshing state... [id=sophos-example-complete5d]
module.complete.aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-dd-PgxsaE]
module.complete.aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-dd-Bve1ON]
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-dd-Bve1ON]
module.complete.aws_iam_role.lambda_execution_role: Refreshing state... [id=LambdaExecutionRole-SOPHOS_CNF-dd]
module.complete.data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Reading...
module.complete.data.aws_ami_ids.sfos: Reading...
module.complete.data.aws_region.current: Reading...
module.complete.data.aws_availability_zones.available: Reading...
module.complete.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_iam_policy_document.trust_relationship: Reading...
module.complete.data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-dd-Bve1ON|7E554A89-E20C-47A9-B624-87A3C0A4C679]
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-dd-Bve1ON|268F8A20-6E87-4D89-A93F-97F82D9C1CAD]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Reading...
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Read complete after 0s [id=482096056]
module.complete.data.template_file.user_data: Reading...
module.complete.data.template_file.user_data: Read complete after 0s [id=9fe490c278459d75ba83b9dec40a4054c5715f17b1557d6610649eb2cb028223]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Reading...
module.complete.aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-dd-PgxsaE|006D5291-3AD8-456C-9951-52B7B7EB832D]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Read complete after 0s [id=4277679882]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zone.available["us-west-1b"]: Reading...
data.aws_availability_zone.available["us-west-1c"]: Reading...
module.complete.data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zone.available["us-west-1b"]: Read complete after 0s [id=us-west-1b]
data.aws_availability_zone.available["us-west-1c"]: Read complete after 0s [id=us-west-1c]
module.complete.data.aws_ami_ids.sfos: Read complete after 0s [id=1726762986]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 0s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 0s [id=ami-0fb2a8cf2684fdb0c]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 0s [id=ami-065fabeba927f04d3]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 0s [id=ami-091558582143f9648]
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 0s [id=ami-04b0be28f678af9ee]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 1s [id=ami-03cbb6f8e3173ca7a]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 1s [id=ami-0b68236d144f48351]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 1s [id=ami-059bf44c0f5e904d9]
module.complete.data.aws_caller_identity.current: Read complete after 1s [id=447552758530]
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.aws_vpc.this[0]: Refreshing state... [id=vpc-0e5b28f9e0f726640]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 1s [id=ami-0eafce265f8e28d06]
module.complete.aws_iam_role.this: Refreshing state... [id=ec2-iam-role-SOPHOS_CNF-dd-447552758530]
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 1s [id=ami-026c32ba32c93b8c4]
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Read complete after 1s [id=ami-0434af33056d1e189]
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Read complete after 1s [id=ami-0028214389e81fc39]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 0s [id=ami-0442ca42ae7162b75]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 0s [id=ami-07186848dc5aa7580]
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 0s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 0s [id=ami-030bf19f87a227c8a]
module.complete.aws_security_group.public[0]: Refreshing state... [id=sg-09776ffa66e6303de]
module.complete.aws_security_group.lan[0]: Refreshing state... [id=sg-019f5d3d55cdde897]
module.complete.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a166b60b9cd9164d]
module.complete.aws_security_group.trusted[0]: Refreshing state... [id=sg-0633e24f1bc6e9a2c]
module.complete.aws_route_table.public[0]: Refreshing state... [id=rtb-009a36b1352658cb9]
module.complete.aws_subnet.public[0]: Refreshing state... [id=subnet-026e8cb0facbdd665]
module.complete.aws_subnet.private[0]: Refreshing state... [id=subnet-0b01cfcf7afaf8a99]
module.complete.aws_route_table.private[0]: Refreshing state... [id=rtb-00062e80ee9bb3d1d]
module.complete.aws_route.public: Refreshing state... [id=r-rtb-009a36b1352658cb91080289494]
module.complete.aws_route_table_association.public: Refreshing state... [id=rtbassoc-0889ff52fe30155f2]
module.complete.aws_network_interface.private: Refreshing state... [id=eni-0a83dab759fd9c357]
module.complete.aws_network_interface.public: Refreshing state... [id=eni-0596b98a898164aab]
module.complete.aws_route_table_association.private: Refreshing state... [id=rtbassoc-003add6eca66b1df6]
module.complete.aws_route.private: Refreshing state... [id=r-rtb-00062e80ee9bb3d1d1080289494]
module.complete.aws_eip.this[0]: Refreshing state... [id=eipalloc-0bc31b5c2c259ad15]
module.complete.aws_iam_instance_profile.this: Refreshing state... [id=ec2-instance-profile-SOPHOS_CNF-dd]
module.complete.aws_launch_template.this: Refreshing state... [id=lt-081750a482a63ae63]
module.complete.aws_instance.this: Refreshing state... [id=i-008e12b711ced33f1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # random_id.this will be destroyed
  - resource "random_id" "this" {
      - b64_std     = "example-completeXQ==" -> null
      - b64_url     = "example-completeXQ" -> null
      - byte_length = 1 -> null
      - dec         = "example-complete93" -> null
      - hex         = "example-complete5d" -> null
      - id          = "XQ" -> null
      - prefix      = "example-complete" -> null
    }

  # module.complete.aws_eip.this[0] will be destroyed
  - resource "aws_eip" "this" {
      - allocation_id             = "eipalloc-0bc31b5c2c259ad15" -> null
      - associate_with_private_ip = "10.0.0.253" -> null
      - association_id            = "eipassoc-0d028381d71554736" -> null
      - domain                    = "vpc" -> null
      - id                        = "eipalloc-0bc31b5c2c259ad15" -> null
      - instance                  = "i-008e12b711ced33f1" -> null
      - network_border_group      = "us-west-1" -> null
      - network_interface         = "eni-0596b98a898164aab" -> null
      - private_dns               = "ip-10-0-0-253.us-west-1.compute.internal" -> null
      - private_ip                = "10.0.0.253" -> null
      - public_dns                = "ec2-184-169-142-90.us-west-1.compute.amazonaws.com" -> null
      - public_ip                 = "184.169.142.90" -> null
      - public_ipv4_pool          = "amazon" -> null
      - tags                      = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                  = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc                       = true -> null
    }

  # module.complete.aws_iam_instance_profile.this will be destroyed
  - resource "aws_iam_instance_profile" "this" {
      - arn         = "arn:aws:iam::447552758530:instance-profile/ec2-instance-profile-SOPHOS_CNF-dd" -> null
      - create_date = "2022-09-28T19:02:47Z" -> null
      - id          = "ec2-instance-profile-SOPHOS_CNF-dd" -> null
      - name        = "ec2-instance-profile-SOPHOS_CNF-dd" -> null
      - path        = "/" -> null
      - role        = "ec2-iam-role-SOPHOS_CNF-dd-447552758530" -> null
      - tags        = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all    = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - unique_id   = "AIPAWQNBZEMBLVWGJJWST" -> null
    }

  # module.complete.aws_iam_role.lambda_execution_role will be destroyed
  - resource "aws_iam_role" "lambda_execution_role" {
      - arn                   = "arn:aws:iam::447552758530:role/LambdaExecutionRole-SOPHOS_CNF-dd" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-09-28T22:29:30Z" -> null
      - force_detach_policies = false -> null
      - id                    = "LambdaExecutionRole-SOPHOS_CNF-dd" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "LambdaExecutionRole-SOPHOS_CNF-dd" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAWQNBZEMBL47FLUQZT" -> null
    }

  # module.complete.aws_iam_role.this will be destroyed
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::447552758530:role/ec2-iam-role-SOPHOS_CNF-dd-447552758530" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-09-28T19:02:46Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ec2-iam-role-SOPHOS_CNF-dd-447552758530" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ec2-iam-role-SOPHOS_CNF-dd-447552758530" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all              = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - unique_id             = "AROAWQNBZEMBHTKQ6KOZT" -> null

      - inline_policy {
          - name   = "ec2-policy-SOPHOS_CNF-dd" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "secretsmanager:GetSecretValue",
                              - "secretsmanager:DescribeSecret",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-dd-PgxsaE",
                              - "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-dd-Bve1ON",
                            ]
                          - Sid      = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "ssm-policy-SOPHOS_CNF-dd" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "secretsmanager:GetSecretValue",
                              - "secretsmanager:DescribeSecret",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-dd-Bve1ON"
                          - Sid      = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.complete.aws_instance.this will be destroyed
  - resource "aws_instance" "this" {
      - ami                                  = "ami-0f37b9b5182756d01" -> null
      - arn                                  = "arn:aws:ec2:us-west-1:447552758530:instance/i-008e12b711ced33f1" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-west-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2-instance-profile-SOPHOS_CNF-dd" -> null
      - id                                   = "i-008e12b711ced33f1" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.medium" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "sophos-example-complete5d" -> null
      - monitoring                           = true -> null
      - primary_network_interface_id         = "eni-0a83dab759fd9c357" -> null
      - private_dns                          = "ip-10-0-1-209.us-west-1.compute.internal" -> null
      - private_ip                           = "10.0.1.209" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = false -> null
      - subnet_id                            = "subnet-0b01cfcf7afaf8a99" -> null
      - tags                                 = {
          - "Name"          = "sophos-xg-terraform"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                             = {
          - "Name"          = "sophos-xg-terraform"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "1be61f38db292e6272a4d799c8c11bb176a88242" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-019f5d3d55cdde897",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - ebs_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvdg" -> null
          - encrypted             = false -> null
          - iops                  = 240 -> null
          - snapshot_id           = "snap-0ac9373189f97066a" -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-07081e85d06348902" -> null
          - volume_size           = 80 -> null
          - volume_type           = "gp2" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - launch_template {
          - id      = "lt-081750a482a63ae63" -> null
          - name    = "launch-template-SOPHOS_CNF-dd-447552758530" -> null
          - version = "$Latest" -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "enabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0707a95563181fdbe" -> null
          - volume_size           = 16 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.complete.aws_internet_gateway.this[0] will be destroyed
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:us-west-1:447552758530:internet-gateway/igw-0a166b60b9cd9164d" -> null
      - id       = "igw-0a166b60b9cd9164d" -> null
      - owner_id = "447552758530" -> null
      - tags     = {
          - "Name"          = "igw-SOPHOS_CNF-dd-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all = {
          - "Name"          = "igw-SOPHOS_CNF-dd-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id   = "vpc-0e5b28f9e0f726640" -> null
    }

  # module.complete.aws_launch_template.this will be destroyed
  - resource "aws_launch_template" "this" {
      - arn                     = "arn:aws:ec2:us-west-1:447552758530:launch-template/lt-081750a482a63ae63" -> null
      - default_version         = 1 -> null
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      - id                      = "lt-081750a482a63ae63" -> null
      - image_id                = "ami-0f37b9b5182756d01" -> null
      - instance_type           = "t3.medium" -> null
      - key_name                = "sophos-example-complete5d" -> null
      - latest_version          = 1 -> null
      - name                    = "launch-template-SOPHOS_CNF-dd-447552758530" -> null
      - security_group_names    = [] -> null
      - tags                    = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - user_data               = "eyJzc21rU2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OnNvcGhvcy1mdy1zZWN1cmUtc3RvcmFnZS1tYXN0ZXIta2V5LVNPUEhPU19DTkYtZGQtQnZlMU9OIiwiaG9zdG5hbWUiOiJzb3Bob3MteGctdGVycmFmb3JtIiwic2VuZHN0YXRzIjogIm9uIiwicmVnaW9uIjoidXMtd2VzdC0xIiwic2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OnNvcGhvcy1mdy1jb25zb2xlLXBhc3N3b3JkLVNPUEhPU19DTkYtZGQtUGd4c2FFIiwiY29uZmlnU2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OnNvcGhvcy1mdy1iYWNrdXAtY29uZmlndXJhdGlvbi1wYXNzd29yZC1TT1BIT1NfQ05GLWRkLUJ2ZTFPTiJ9" -> null
      - vpc_security_group_ids  = [] -> null

      - block_device_mappings {
          - device_name = "/dev/xvda" -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "false" -> null
              - iops                  = 0 -> null
              - throughput            = 0 -> null
              - volume_size           = 16 -> null
              - volume_type           = "gp2" -> null
            }
        }
      - block_device_mappings {
          - device_name = "/dev/xvdg" -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "false" -> null
              - iops                  = 0 -> null
              - throughput            = 0 -> null
              - volume_size           = 80 -> null
              - volume_type           = "gp2" -> null
            }
        }

      - iam_instance_profile {
          - name = "ec2-iam-role-SOPHOS_CNF-dd-447552758530" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "enabled" -> null
        }

      - network_interfaces {
          - device_index         = 1 -> null
          - ipv4_address_count   = 0 -> null
          - ipv4_addresses       = [] -> null
          - ipv4_prefix_count    = 0 -> null
          - ipv4_prefixes        = [] -> null
          - ipv6_address_count   = 0 -> null
          - ipv6_addresses       = [] -> null
          - ipv6_prefix_count    = 0 -> null
          - ipv6_prefixes        = [] -> null
          - network_card_index   = 0 -> null
          - network_interface_id = "eni-0596b98a898164aab" -> null
          - security_groups      = [] -> null
        }
      - network_interfaces {
          - device_index         = 0 -> null
          - ipv4_address_count   = 0 -> null
          - ipv4_addresses       = [] -> null
          - ipv4_prefix_count    = 0 -> null
          - ipv4_prefixes        = [] -> null
          - ipv6_address_count   = 0 -> null
          - ipv6_addresses       = [] -> null
          - ipv6_prefix_count    = 0 -> null
          - ipv6_prefixes        = [] -> null
          - network_card_index   = 0 -> null
          - network_interface_id = "eni-0a83dab759fd9c357" -> null
          - security_groups      = [] -> null
        }
    }

  # module.complete.aws_network_interface.private will be destroyed
  - resource "aws_network_interface" "private" {
      - arn                       = "arn:aws:ec2:us-west-1:447552758530:network-interface/eni-0a83dab759fd9c357" -> null
      - description               = "ENI for Private Subnet" -> null
      - id                        = "eni-0a83dab759fd9c357" -> null
      - interface_type            = "interface" -> null
      - ipv4_prefix_count         = 0 -> null
      - ipv4_prefixes             = [] -> null
      - ipv6_address_count        = 0 -> null
      - ipv6_address_list         = [] -> null
      - ipv6_address_list_enabled = false -> null
      - ipv6_addresses            = [] -> null
      - ipv6_prefix_count         = 0 -> null
      - ipv6_prefixes             = [] -> null
      - mac_address               = "06:f6:50:c8:27:b7" -> null
      - owner_id                  = "447552758530" -> null
      - private_dns_name          = "ip-10-0-1-209.us-west-1.compute.internal" -> null
      - private_ip                = "10.0.1.209" -> null
      - private_ip_list           = [
          - "10.0.1.209",
        ] -> null
      - private_ip_list_enabled   = false -> null
      - private_ips               = [
          - "10.0.1.209",
        ] -> null
      - private_ips_count         = 0 -> null
      - security_groups           = [
          - "sg-019f5d3d55cdde897",
        ] -> null
      - source_dest_check         = false -> null
      - subnet_id                 = "subnet-0b01cfcf7afaf8a99" -> null
      - tags                      = {
          - "Name"          = "private-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                  = {
          - "Name"          = "private-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null

      - attachment {
          - attachment_id = "eni-attach-0f564d49943792432" -> null
          - device_index  = 0 -> null
          - instance      = "i-008e12b711ced33f1" -> null
        }
    }

  # module.complete.aws_network_interface.public will be destroyed
  - resource "aws_network_interface" "public" {
      - arn                       = "arn:aws:ec2:us-west-1:447552758530:network-interface/eni-0596b98a898164aab" -> null
      - description               = "ENI for Public Subnet" -> null
      - id                        = "eni-0596b98a898164aab" -> null
      - interface_type            = "interface" -> null
      - ipv4_prefix_count         = 0 -> null
      - ipv4_prefixes             = [] -> null
      - ipv6_address_count        = 0 -> null
      - ipv6_address_list         = [] -> null
      - ipv6_address_list_enabled = false -> null
      - ipv6_addresses            = [] -> null
      - ipv6_prefix_count         = 0 -> null
      - ipv6_prefixes             = [] -> null
      - mac_address               = "06:01:15:0a:6d:79" -> null
      - owner_id                  = "447552758530" -> null
      - private_dns_name          = "ip-10-0-0-253.us-west-1.compute.internal" -> null
      - private_ip                = "10.0.0.253" -> null
      - private_ip_list           = [
          - "10.0.0.253",
        ] -> null
      - private_ip_list_enabled   = false -> null
      - private_ips               = [
          - "10.0.0.253",
        ] -> null
      - private_ips_count         = 0 -> null
      - security_groups           = [
          - "sg-0633e24f1bc6e9a2c",
          - "sg-09776ffa66e6303de",
        ] -> null
      - source_dest_check         = false -> null
      - subnet_id                 = "subnet-026e8cb0facbdd665" -> null
      - tags                      = {
          - "Name"          = "public-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                  = {
          - "Name"          = "public-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null

      - attachment {
          - attachment_id = "eni-attach-0f57d9bbddacdc362" -> null
          - device_index  = 1 -> null
          - instance      = "i-008e12b711ced33f1" -> null
        }
    }

  # module.complete.aws_route.private will be destroyed
  - resource "aws_route" "private" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-00062e80ee9bb3d1d1080289494" -> null
      - instance_id            = "i-008e12b711ced33f1" -> null
      - instance_owner_id      = "447552758530" -> null
      - network_interface_id   = "eni-0a83dab759fd9c357" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-00062e80ee9bb3d1d" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.complete.aws_route.public will be destroyed
  - resource "aws_route" "public" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-0a166b60b9cd9164d" -> null
      - id                     = "r-rtb-009a36b1352658cb91080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-009a36b1352658cb9" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.complete.aws_route_table.private[0] will be destroyed
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-west-1:447552758530:route-table/rtb-00062e80ee9bb3d1d" -> null
      - id               = "rtb-00062e80ee9bb3d1d" -> null
      - owner_id         = "447552758530" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = "i-008e12b711ced33f1"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = "eni-0a83dab759fd9c357"
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name"          = "priv-rtb-SOPHOS_CNF-dd-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all         = {
          - "Name"          = "priv-rtb-SOPHOS_CNF-dd-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id           = "vpc-0e5b28f9e0f726640" -> null
    }

  # module.complete.aws_route_table.public[0] will be destroyed
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-west-1:447552758530:route-table/rtb-009a36b1352658cb9" -> null
      - id               = "rtb-009a36b1352658cb9" -> null
      - owner_id         = "447552758530" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-0a166b60b9cd9164d"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name"          = "pub-rtb-SOPHOS_CNF-dd-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all         = {
          - "Name"          = "pub-rtb-SOPHOS_CNF-dd-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id           = "vpc-0e5b28f9e0f726640" -> null
    }

  # module.complete.aws_route_table_association.private will be destroyed
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-003add6eca66b1df6" -> null
      - route_table_id = "rtb-00062e80ee9bb3d1d" -> null
      - subnet_id      = "subnet-0b01cfcf7afaf8a99" -> null
    }

  # module.complete.aws_route_table_association.public will be destroyed
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0889ff52fe30155f2" -> null
      - route_table_id = "rtb-009a36b1352658cb9" -> null
      - subnet_id      = "subnet-026e8cb0facbdd665" -> null
    }

  # module.complete.aws_secretsmanager_secret.config_backup_password will be destroyed
  - resource "aws_secretsmanager_secret" "config_backup_password" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-dd-Bve1ON" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-dd-Bve1ON" -> null
      - name                           = "sophos-fw-backup-configuration-password-SOPHOS_CNF-dd" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "logical-id" = "PasswordSecret"
        } -> null
      - tags_all                       = {
          - "logical-id" = "PasswordSecret"
        } -> null
    }

  # module.complete.aws_secretsmanager_secret.console_password will be destroyed
  - resource "aws_secretsmanager_secret" "console_password" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-dd-PgxsaE" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-dd-PgxsaE" -> null
      - name                           = "sophos-fw-console-password-SOPHOS_CNF-dd" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "logical-id" = "PasswordSecret"
        } -> null
      - tags_all                       = {
          - "logical-id" = "PasswordSecret"
        } -> null
    }

  # module.complete.aws_secretsmanager_secret.secure_storage_master_key will be destroyed
  - resource "aws_secretsmanager_secret" "secure_storage_master_key" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-dd-Bve1ON" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-dd-Bve1ON" -> null
      - name                           = "sophos-fw-secure-storage-master-key-SOPHOS_CNF-dd" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "logical-id" = "PasswordSecret"
        } -> null
      - tags_all                       = {
          - "logical-id" = "PasswordSecret"
        } -> null
    }

  # module.complete.aws_secretsmanager_secret_version.config_backup_password will be destroyed
  - resource "aws_secretsmanager_secret_version" "config_backup_password" {
      - arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-dd-Bve1ON" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-dd-Bve1ON|7E554A89-E20C-47A9-B624-87A3C0A4C679" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-dd-Bve1ON" -> null
      - secret_string  = (sensitive value)
      - version_id     = "7E554A89-E20C-47A9-B624-87A3C0A4C679" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.complete.aws_secretsmanager_secret_version.console_password will be destroyed
  - resource "aws_secretsmanager_secret_version" "console_password" {
      - arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-dd-PgxsaE" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-dd-PgxsaE|006D5291-3AD8-456C-9951-52B7B7EB832D" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-dd-PgxsaE" -> null
      - secret_string  = (sensitive value)
      - version_id     = "006D5291-3AD8-456C-9951-52B7B7EB832D" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.complete.aws_secretsmanager_secret_version.secure_storage_master_key will be destroyed
  - resource "aws_secretsmanager_secret_version" "secure_storage_master_key" {
      - arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-dd-Bve1ON" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-dd-Bve1ON|268F8A20-6E87-4D89-A93F-97F82D9C1CAD" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-dd-Bve1ON" -> null
      - secret_string  = (sensitive value)
      - version_id     = "268F8A20-6E87-4D89-A93F-97F82D9C1CAD" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.complete.aws_security_group.lan[0] will be destroyed
  - resource "aws_security_group" "lan" {
      - arn                    = "arn:aws:ec2:us-west-1:447552758530:security-group/sg-019f5d3d55cdde897" -> null
      - description            = "Security Group for private subnet. Allow everything by default" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-019f5d3d55cdde897" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "Private Subnet" -> null
      - owner_id               = "447552758530" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"          = "LAN"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all               = {
          - "Name"          = "LAN"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-0e5b28f9e0f726640" -> null
    }

  # module.complete.aws_security_group.public[0] will be destroyed
  - resource "aws_security_group" "public" {
      - arn                    = "arn:aws:ec2:us-west-1:447552758530:security-group/sg-09776ffa66e6303de" -> null
      - description            = "Untrusted network restricted from access port 22 and 4444" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all traffic outbound"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-09776ffa66e6303de" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow public access 0 - 21"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 21
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow public access 23 - 4443"
              - from_port        = 23
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 4443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow public access 4445 - 65535"
              - from_port        = 4445
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "Public" -> null
      - owner_id               = "447552758530" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"          = "Public"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all               = {
          - "Name"          = "Public"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-0e5b28f9e0f726640" -> null
    }

  # module.complete.aws_security_group.trusted[0] will be destroyed
  - resource "aws_security_group" "trusted" {
      - arn                    = "arn:aws:ec2:us-west-1:447552758530:security-group/sg-0633e24f1bc6e9a2c" -> null
      - description            = "Enable TCP access from trusted network" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all traffic outbound"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0633e24f1bc6e9a2c" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "47.184.79.94/32",
                  - "13.65.56.73/32",
                ]
              - description      = "Allow all from trusted IP"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "Trusted Network" -> null
      - owner_id               = "447552758530" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"          = "Trusted Network"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all               = {
          - "Name"          = "Trusted Network"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-0e5b28f9e0f726640" -> null
    }

  # module.complete.aws_subnet.private[0] will be destroyed
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-west-1:447552758530:subnet/subnet-0b01cfcf7afaf8a99" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-1b" -> null
      - availability_zone_id                           = "usw1-az3" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0b01cfcf7afaf8a99" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "447552758530" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "private-SOPHOS_CNF-dd-447552758530"
        } -> null
      - tags_all                                       = {
          - "Name" = "private-SOPHOS_CNF-dd-447552758530"
        } -> null
      - vpc_id                                         = "vpc-0e5b28f9e0f726640" -> null
    }

  # module.complete.aws_subnet.public[0] will be destroyed
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-west-1:447552758530:subnet/subnet-026e8cb0facbdd665" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-1b" -> null
      - availability_zone_id                           = "usw1-az3" -> null
      - cidr_block                                     = "10.0.0.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-026e8cb0facbdd665" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "447552758530" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"          = "public-SOPHOS_CNF-dd-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                                       = {
          - "Name"          = "public-SOPHOS_CNF-dd-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                                         = "vpc-0e5b28f9e0f726640" -> null
    }

  # module.complete.aws_vpc.this[0] will be destroyed
  - resource "aws_vpc" "this" {
      - arn                              = "arn:aws:ec2:us-west-1:447552758530:vpc/vpc-0e5b28f9e0f726640" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_network_acl_id           = "acl-09d9e388a7c1dcd11" -> null
      - default_route_table_id           = "rtb-06cb848758dd6aac8" -> null
      - default_security_group_id        = "sg-0a5075c0cebf3c7ae" -> null
      - dhcp_options_id                  = "dopt-001808c76c9383c0b" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = true -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-0e5b28f9e0f726640" -> null
      - instance_tenancy                 = "default" -> null
      - ipv6_netmask_length              = 0 -> null
      - main_route_table_id              = "rtb-06cb848758dd6aac8" -> null
      - owner_id                         = "447552758530" -> null
      - tags                             = {
          - "Name"          = "SOPHOS_CNF-dd-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                         = {
          - "Name"          = "SOPHOS_CNF-dd-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-28-2022"
          - "managed_by"    = "Terraform"
        } -> null
    }

  # module.complete.random_id.this will be destroyed
  - resource "random_id" "this" {
      - b64_std     = "SOPHOS_CNF-3Q==" -> null
      - b64_url     = "SOPHOS_CNF-3Q" -> null
      - byte_length = 1 -> null
      - dec         = "SOPHOS_CNF-221" -> null
      - hex         = "SOPHOS_CNF-dd" -> null
      - id          = "3Q" -> null
      - prefix      = "SOPHOS_CNF-" -> null
    }

  # module.key-pair.aws_key_pair.this[0] will be destroyed
  - resource "aws_key_pair" "this" {
      - arn         = "arn:aws:ec2:us-west-1:447552758530:key-pair/sophos-example-complete5d" -> null
      - fingerprint = "1e:a0:81:81:e9:f9:ad:8c:13:72:77:06:25:1f:1f:54" -> null
      - id          = "sophos-example-complete5d" -> null
      - key_name    = "sophos-example-complete5d" -> null
      - key_pair_id = "key-0f18b232dd24213ce" -> null
      - key_type    = "rsa" -> null
      - public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDijFOdSSvmLDUduv5NPVoxNKRbxPoyoVWWK5YYJQJPL/y8AaEis/z6iKYmjn3Hum+tCdi9BZgJl7nzOTQ5KW92VWiQF9iVbvrnYJqtGhuwermBxJy9WAOumedtYr3o3UME+ohht1w4wGNa2ICRiM2KZ6pVT9PxPqb45HkttQq3Mue1RDdeEym7kc/EqC2MEAZ+vDn94f8uQTGdPbLkNEzU8SQM3BWHmG35RNvaI2oAdwAL/lXiG2Wk/phMDfArfb6JtrC2dvBlvhrMaV6WF/7/R0ZMvQrwPOJbCABwIJt8vxE8FzfKFO5dBCpGZGr8QS7fwRj06Xv99h5or6caZGmvfWfv2tSS3/wG4b4oGiItV8IjQWYufl0to3jtyDTVNYekVazxRjbKoVpOrpf1IOMeSc3N5fJ9nEDUAl7/q4jHcYHq95t/YT8k9b1MvwTYCDL0kdg05TSLbMhNgACn5zNVQRRRBWaGmj2pAlUITC1BLrURWaEER4KNqjqwegxdOJiP56P2t9bgTHKiENR5ExTZ5Zqvr9fy2YOxiC0MBecHv1JfoF01Xo+6qcgE5x1osykiL/SLLVXXWsRZkflZbo7+59MTqltLEUewROaq5GawQWbO8jhBYNBOJF/fuXAI7vPZtGJlL1JY6GrBG55BYg0nLw/bCk3xE/NZ1XwPt9/O0w==" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # module.key-pair.tls_private_key.this[0] will be destroyed
  - resource "tls_private_key" "this" {
      - algorithm                     = "RSA" -> null
      - ecdsa_curve                   = "P224" -> null
      - id                            = "d61857760060ac9a400b6151dc82097725229b4f" -> null
      - private_key_openssh           = (sensitive value)
      - private_key_pem               = (sensitive value)
      - private_key_pem_pkcs8         = (sensitive value)
      - public_key_fingerprint_md5    = "3d:ca:40:75:88:3d:c0:11:71:41:c1:d8:fc:2c:1c:7c" -> null
      - public_key_fingerprint_sha256 = "SHA256:tWxcw4xYaWDBq5q0b2ao1SbjtA08gRkt4n9Ao1JKFa8" -> null
      - public_key_openssh            = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDijFOdSSvmLDUduv5NPVoxNKRbxPoyoVWWK5YYJQJPL/y8AaEis/z6iKYmjn3Hum+tCdi9BZgJl7nzOTQ5KW92VWiQF9iVbvrnYJqtGhuwermBxJy9WAOumedtYr3o3UME+ohht1w4wGNa2ICRiM2KZ6pVT9PxPqb45HkttQq3Mue1RDdeEym7kc/EqC2MEAZ+vDn94f8uQTGdPbLkNEzU8SQM3BWHmG35RNvaI2oAdwAL/lXiG2Wk/phMDfArfb6JtrC2dvBlvhrMaV6WF/7/R0ZMvQrwPOJbCABwIJt8vxE8FzfKFO5dBCpGZGr8QS7fwRj06Xv99h5or6caZGmvfWfv2tSS3/wG4b4oGiItV8IjQWYufl0to3jtyDTVNYekVazxRjbKoVpOrpf1IOMeSc3N5fJ9nEDUAl7/q4jHcYHq95t/YT8k9b1MvwTYCDL0kdg05TSLbMhNgACn5zNVQRRRBWaGmj2pAlUITC1BLrURWaEER4KNqjqwegxdOJiP56P2t9bgTHKiENR5ExTZ5Zqvr9fy2YOxiC0MBecHv1JfoF01Xo+6qcgE5x1osykiL/SLLVXXWsRZkflZbo7+59MTqltLEUewROaq5GawQWbO8jhBYNBOJF/fuXAI7vPZtGJlL1JY6GrBG55BYg0nLw/bCk3xE/NZ1XwPt9/O0w==
        EOT -> null
      - public_key_pem                = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA4oxTnUkr5iw1Hbr+TT1a
            MTSkW8T6MqFVliuWGCUCTy/8vAGhIrP8+oimJo59x7pvrQnYvQWYCZe58zk0OSlv
            dlVokBfYlW7652CarRobsHq5gcScvVgDrpnnbWK96N1DBPqIYbdcOMBjWtiAkYjN
            imeqVU/T8T6m+OR5LbUKtzLntUQ3XhMpu5HPxKgtjBAGfrw5/eH/LkExnT2y5DRM
            1PEkDNwVh5ht+UTb2iNqAHcAC/5V4htlpP6YTA3wK32+ibawtnbwZb4azGlelhf+
            /0dGTL0K8DziWwgAcCCbfL8RPBc3yhTuXQQqRmRq/EEu38EY9Ol7/fYeaK+nGmRp
            r31n79rUkt/8BuG+KBoiLVfCI0FmLn5dLaN47cg01TWHpFWs8UY2yqFaTq6X9SDj
            HknNzeXyfZxA1AJe/6uIx3GB6vebf2E/JPW9TL8E2Agy9JHYNOU0i2zITYAAp+cz
            VUEUUQVmhpo9qQJVCEwtQS61EVmhBEeCjao6sHoMXTiYj+ej9rfW4ExyohDUeRMU
            2eWar6/X8tmDsYgtDAXnB79SX6BdNV6PuqnIBOcdaLMpIi/0iy1V11rEWZH5WW6O
            /ufTE6pbSxFHsETmquRmsEFmzvI4QWDQTiRf37lwCO7z2bRiZS9SWOhqwRueQWIN
            Jy8P2wpN8RPzWdV8D7ffztMCAwEAAQ==
            -----END PUBLIC KEY-----
        EOT -> null
      - rsa_bits                      = 4096 -> null
    }

Plan: 0 to add, 0 to change, 31 to destroy.

Changes to Outputs:
  - archive_name          = "7517866eb05f876f45c1f92f4725f6c55a51fdd7" -> null
  - availability_zone_map = {
      - us-west-1b = "usw1-az3"
      - us-west-1c = "usw1-az1"
    } -> null
  - private_key           = (sensitive value)
module.complete.aws_eip.this[0]: Destroying... [id=eipalloc-0bc31b5c2c259ad15]
module.complete.aws_route.private: Destroying... [id=r-rtb-00062e80ee9bb3d1d1080289494]
module.complete.aws_route_table_association.public: Destroying... [id=rtbassoc-0889ff52fe30155f2]
module.complete.aws_secretsmanager_secret_version.config_backup_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-dd-Bve1ON|7E554A89-E20C-47A9-B624-87A3C0A4C679]
module.complete.aws_route.public: Destroying... [id=r-rtb-009a36b1352658cb91080289494]
module.complete.aws_route_table_association.private: Destroying... [id=rtbassoc-003add6eca66b1df6]
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-dd-Bve1ON|268F8A20-6E87-4D89-A93F-97F82D9C1CAD]
module.complete.aws_secretsmanager_secret_version.console_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-dd-PgxsaE|006D5291-3AD8-456C-9951-52B7B7EB832D]
module.complete.aws_iam_role.lambda_execution_role: Destroying... [id=LambdaExecutionRole-SOPHOS_CNF-dd]
module.complete.aws_instance.this: Destroying... [id=i-008e12b711ced33f1]
module.complete.aws_secretsmanager_secret_version.config_backup_password: Destruction complete after 0s
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Destruction complete after 0s
module.complete.aws_secretsmanager_secret_version.console_password: Destruction complete after 0s
module.complete.aws_route_table_association.private: Destruction complete after 0s
module.complete.aws_route_table_association.public: Destruction complete after 0s
module.complete.aws_route.private: Destruction complete after 0s
module.complete.aws_route_table.private[0]: Destroying... [id=rtb-00062e80ee9bb3d1d]
module.complete.aws_route.public: Destruction complete after 0s
module.complete.aws_internet_gateway.this[0]: Destroying... [id=igw-0a166b60b9cd9164d]
module.complete.aws_route_table.public[0]: Destroying... [id=rtb-009a36b1352658cb9]
module.complete.aws_iam_role.lambda_execution_role: Destruction complete after 0s
module.complete.aws_route_table.private[0]: Destruction complete after 1s
module.complete.aws_route_table.public[0]: Destruction complete after 1s
module.complete.aws_internet_gateway.this[0]: Destruction complete after 1s
module.complete.aws_eip.this[0]: Destruction complete after 2s
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 1m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 1m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 1m20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 1m30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 1m40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 1m50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 2m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 2m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 2m20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 2m30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 2m40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 2m50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 3m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 3m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 3m20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 3m30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 3m40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 3m50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 4m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 4m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 4m20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 4m30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 4m40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-008e12b711ced33f1, 4m50s elapsed]
module.complete.aws_instance.this: Destruction complete after 4m51s
module.complete.aws_iam_instance_profile.this: Destroying... [id=ec2-instance-profile-SOPHOS_CNF-dd]
module.complete.aws_launch_template.this: Destroying... [id=lt-081750a482a63ae63]
module.complete.aws_launch_template.this: Destruction complete after 0s
module.key-pair.aws_key_pair.this[0]: Destroying... [id=sophos-example-complete5d]
module.complete.aws_network_interface.public: Destroying... [id=eni-0596b98a898164aab]
module.complete.aws_network_interface.private: Destroying... [id=eni-0a83dab759fd9c357]
module.key-pair.aws_key_pair.this[0]: Destruction complete after 0s
random_id.this: Destroying... [id=XQ]
module.key-pair.tls_private_key.this[0]: Destroying... [id=d61857760060ac9a400b6151dc82097725229b4f]
random_id.this: Destruction complete after 0s
module.key-pair.tls_private_key.this[0]: Destruction complete after 0s
module.complete.aws_network_interface.public: Destruction complete after 1s
module.complete.aws_security_group.trusted[0]: Destroying... [id=sg-0633e24f1bc6e9a2c]
module.complete.aws_subnet.public[0]: Destroying... [id=subnet-026e8cb0facbdd665]
module.complete.aws_iam_instance_profile.this: Destruction complete after 1s
module.complete.aws_security_group.public[0]: Destroying... [id=sg-09776ffa66e6303de]
module.complete.aws_iam_role.this: Destroying... [id=ec2-iam-role-SOPHOS_CNF-dd-447552758530]
module.complete.aws_network_interface.private: Destruction complete after 1s
module.complete.aws_subnet.private[0]: Destroying... [id=subnet-0b01cfcf7afaf8a99]
module.complete.aws_security_group.lan[0]: Destroying... [id=sg-019f5d3d55cdde897]
module.complete.aws_subnet.private[0]: Destruction complete after 0s
module.complete.aws_subnet.public[0]: Destruction complete after 0s
module.complete.aws_security_group.trusted[0]: Destruction complete after 0s
module.complete.aws_security_group.public[0]: Destruction complete after 0s
module.complete.aws_iam_role.this: Destruction complete after 0s
module.complete.aws_secretsmanager_secret.console_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-dd-PgxsaE]
module.complete.aws_secretsmanager_secret.config_backup_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-dd-Bve1ON]
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-dd-Bve1ON]
module.complete.aws_security_group.lan[0]: Destruction complete after 0s
module.complete.aws_vpc.this[0]: Destroying... [id=vpc-0e5b28f9e0f726640]
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Destruction complete after 0s
module.complete.aws_secretsmanager_secret.config_backup_password: Destruction complete after 0s
module.complete.aws_secretsmanager_secret.console_password: Destruction complete after 0s
module.complete.aws_vpc.this[0]: Destruction complete after 1s
module.complete.random_id.this: Destroying... [id=3Q]
module.complete.random_id.this: Destruction complete after 0s
Releasing state lock. This may take a few moments...

Destroy complete! Resources: 31 destroyed.

```